Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/N10.tmx
Source language: en_us
Languages: zh_cn

source: Mark had assumed that when he reached the highway someone would immediately pick him up.
zh_cn: 马克以为只要到了公路上，就立马能够搭上车。

source: But car after car went by, and the few drivers who looked at him scowled as if they were angry with him for needing a ride and putting them on the spot.
zh_cn: 但是汽车一辆接一辆地开了过去，而那少数几位看了看他的司机都是怒目而视，好像是因为他想要搭车、让他们为难而生气一样。

source: Mark's face burned, and his throat was so dry it hurt to swallow.
zh_cn: 马克的脸灼痛着，喉咙也很干，吞咽一下都会疼。

source: Twice he had to leave the road to stand in the shade of a billboard.
zh_cn: 有两次，他不得不离开公路，站到广告牌的阴影下。

source: Cars passed him by for more than an hour, cars from Wisconsin and Utah and Georgia and just about everywhere.
zh_cn: 在一个多小时的时间里，从威斯康辛、犹他、佐治亚等各个地方驶来的汽车不断从他身边经过。

source: Mark felt like the whole country had turned its back on him.
zh_cn: 马克觉得整个国家都背弃了他。

source: The thought came to him that he could die out here.
zh_cn: 他觉得自己会死在那里。

source: Finally a car stopped.
zh_cn: 最终有辆车停了下来。

source: It was a hearse.
zh_cn: 那是辆灵车。

source: Mark hesitated, then ran toward it.
zh_cn: 马克犹豫了一下，然后朝它跑了过去。

source: There were three people in the front seat, a man between two women.
zh_cn: 前排座位上坐着三个人，两个女人，中间一个男人。

source: There was no rear seat.
zh_cn: 后排没有座位。

source: The space in back was full of electrical equipment.
zh_cn: 后面的车厢里全是电子设备。

source: Mark pushed some wires out of his way and sat cross-legged on the floor.
zh_cn: 马克推开面前的一些电线，然后盘腿坐在了地上。

source: He felt the breeze from the air conditioner; it was like a stream of cold water running over him.
zh_cn: 他感受到空调吹出的微风，就像冰冷的水流从他身上淌过。

source: The driver pulled back onto the road.
zh_cn: 司机再次把车开上路。

source: "Welcome to the stiffmobile," said the man beside her.
zh_cn: “欢迎来到流浪快车，”女司机边上的男人说。

source: He turned around.
zh_cn: 他转过身子。

source: His head was shaved except for one bristling stripe of hair down the center.
zh_cn: 他的脑袋剃得只剩下中间一条短而硬的头发。

source: It was the first Mohawk haircut Mark had ever seen.
zh_cn: 这是马克第一次见到莫霍克发型。

source: The man's eyebrows were the same carroty color as his hair.
zh_cn: 这个男人的眉毛和头发都是橘红色。

source: He had freckles. The freckles covered his entire face and even the shaved parts of his skull.
zh_cn: 他还长有雀斑，满脸都是，甚至剃光了头发的头顶上也有。

source: "Stiffmobile, cliffmobile," said the woman driving. "Riff-mobile."
zh_cn: “流浪快车，悬崖快车，”开车的那个女人说，“重复快车。”

source: "Bet you thought you'd be riding with a cold one," the man said.
zh_cn: “你之前肯定觉得车上有个冷冰冰的东西，”那个男人说。

source: Mark shrugged.
zh_cn: 马克耸耸肩。

source: "I'd rather ride with a cold one than a hot one."
zh_cn: “我宁愿要冷冰冰，也不要热烘烘。”

source: The man laughed and pounded on the back of the seat.
zh_cn: 那个男人大笑起来，不断捶打椅背。

source: The two women also laughed.
zh_cn: 那两个女人也大笑起来。

source: The one not driving turned around and looked at Mark.
zh_cn: 没有开车的那个女人转过身，看着马克。

source: She had a round, soft-looking face. Her lips were full. She wore a small gold earring in one side of her nose.
zh_cn: 她的圆脸没有棱角，双唇饱满，一只鼻孔上穿着不大的金环。

source: "Speaking of cold ones," the man said, "there's a case of them right behind you."
zh_cn: “说到冷冰冰的东西，”那个男人说，“你背后有个箱子。”

source: Mark fished a can of beer out of the cooler.
zh_cn: 马克从冷藏箱里拿出一罐啤酒。

source: He took a long swallow, head back, eyes closed.
zh_cn: 他闭着眼睛，仰头喝了一大口。

source: When he opened his eyes again the man with the Mohawk was watching him.
zh_cn: 当他再次睁开眼睛时，那个留着莫霍克发型的男人正看着他。

source: They introduced themselves, all but the woman driving.
zh_cn: 除了女司机以外，他们都相互作了介绍。

source: She never looked at Mark or spoke, except to herself.
zh_cn: 那个女司机没有看马克，也没有对马克说话，只是在自言自语。

source: The man with the Mohawk was Barney. The girl with the earring was Nance.
zh_cn: 那个留着莫霍克发型的男人叫巴尼，戴鼻环那个女人叫南斯。

source: They joked back and forth, and Mark discovered that Nance had a terrific sense of humor.
zh_cn: 两人相互开着玩笑，马克发现南斯特别有幽默感。

source: She picked up on almost everything he said.
zh_cn: 他说的每句话，她几乎都能接得下去。

source: After a while the earring in her nose ceased to bother him.
zh_cn: 没过多久，她的鼻环就不再让他觉得不舒服了。

source: When Barney heard that Mark had been in the army he shook his head.
zh_cn: 听说马克曾经参过军，巴尼摇了摇头。

source: "Pass on that," he said. "No bang-bang for Barney.
zh_cn: “别说这个，”他说，“不要给巴尼砰砰砰。

source: I can't stand the sight of my own brains."
zh_cn: 看到自己的大脑我可受不了。”

source: "Trains," the driver said. "Cranes, lanes, stains."
zh_cn: “大脑，”女司机说，“小脑，头脑，丘脑。”

source: "Smoothe out," Barney told her.
zh_cn: “你够了，”巴尼对她说。

source: He turned back to Mark.
zh_cn: 他转回来对着马克。

source: "So what was it like over there?"
zh_cn: “那边怎么样？”

source: Mark realized that Barney meant Vietnam.
zh_cn: 马克意识到他说的是越南。

source: Mark had not been to Vietnam.
zh_cn: 马克没去过越南。

source: He'd had orders to go, but the orders were killed just before he left and never reissued.
zh_cn: 他得到了去越南的命令，但就在他出发前，命令就被撤销了，然后再也没有发下来。

source: He didn't know why.
zh_cn: 他不知道为什么。

source: It was too complicated to explain, so he just said, "Pretty bad," and left it at that.
zh_cn: 这件事很复杂，不好解释，所以他只是说：“特别糟糕。”然后就没有再往下说了。

source: The mention of Vietnam broke the good feeling between them.
zh_cn: 提到越南，他们之间的好感就被打破了。

source: They drank their beers and looked at the desert passing by.
zh_cn: 他们喝着各自的啤酒，看着向后逝去的沙漠。

source: Then Barney crumpled his can and threw it out the window.
zh_cn: 然后，巴尼捏皱他的啤酒罐，然后把它扔到了窗外。

source: Hot air blew into Mark's face.
zh_cn: 炎热的空气吹到马克的脸上。

source: He remembered what it was like out there, and felt glad to be right where he was.
zh_cn: 他记得车外是什么感觉，所以很高兴自己在车里面。

source: "I could get behind another beer," Nance said.
zh_cn: “我可以再喝罐啤酒，”南斯说。

source: "Right," Barney said.
zh_cn: “好，”巴尼说。

source: He turned around and told Mark to pop some more frosties.
zh_cn: 他转过身，让马克再开些啤酒。

source: While Mark was getting the cans out of the cooler Barney watched him, playing his fingers over the top of the seat as if it were a keyboard.
zh_cn: 马克从冷藏箱里拿出啤酒，马克则看着他，在椅背顶部敲打着手指，就像敲键盘那样。

source: "So what's in Blythe?" he said.
zh_cn: “那你去布莱兹干嘛？”他说。

source: "Smythe," the driver said. "Smythe's in Blythe."
zh_cn: “斯麦兹，”女司机说，“去布莱兹找斯麦兹。”

source: "Be cool," Nance said to her.
zh_cn: “淡定，”南斯对她说。

source: "I need a part," Mark said.
zh_cn: “我要去买个零件，”马克说。

source: He handed out the beers.
zh_cn: 他把啤酒递出去。

source: "An alternator.
zh_cn: “交流发电机。

source: My car's on the fritz."
zh_cn: 我的车出问题了。”

source: "Where's your car?" Barney said.
zh_cn: “你的车在哪里？”巴尼说。

source: Mark jerked his thumb over his shoulder.
zh_cn: 马克用大拇指往身后指了指。

source: "Back there. I don't know the name of the place.
zh_cn: “后面，我不知道那个地方叫什么。

source: It's just this gas station off the highway." Nance was looking at him.
zh_cn: 只是公路下面的一家加油站，”南斯正看着他。

source: She kept watching him.
zh_cn: 她一直都在看着他。

source: "Hey," she said. "What if you didn't stop smiling?
zh_cn: “嘿，”她说，“你要是微笑着不停会是怎么样？

source: What if you just kept smiling and never stopped?"
zh_cn: 你要是保持着微笑，永远不停下来，会怎么样？”

source: Barney looked at her. Then he looked back at Mark.
zh_cn: 巴尼看了看她，然后又回来看着马克。

source: "To me," he said, "there are places you go and places you don't go.
zh_cn: “对我来说，”他说，“有些地方你要去，有些地方你不用去。

source: You don't go to Rochester.
zh_cn: 你不用去罗彻斯特。

source: You don't go to Blythe."
zh_cn: 你不用去布莱兹。”

source: "You definitely don't go to Blythe," Nance said.
zh_cn: “你绝对不用去布莱兹，”南斯说。

source: "Right," Barney said. Then he listed some of the places where, in his opinion, you do go.
zh_cn: “就是，”巴尼说道，然后又列出了几个在他看来必须得去的地方。

source: They were going to one of them now, San Lucas, up in the mountains above Santa Fe.
zh_cn: 他们现在就要去其中一个地方，圣达菲上面山间的圣卢卡斯。

source: They were part of a film crew shooting a Western there.
zh_cn: 他们是某个在圣卢卡斯拍西部片的剧组的成员。

source: They had shot another movie in the same place a year ago and this was the sequel.
zh_cn: 他们去年就在那里拍过另外一部电影，这次是拍续集。

source: Barney was a sound man. Nance did make-up.
zh_cn: 巴尼是录音师，南斯是化妆师。

source: They didn't say anything about the driver.
zh_cn: 他们没有说关于那个女司机的事情。

source: "The place is unbelievable," Barney said.
zh_cn: “那个地方棒极了，”巴尼说。

source: He paused and shook his head.
zh_cn: 他停顿下来，摇了摇头。

source: Mark was waiting for him to describe San Lucas, but Barney just shook his head again and said, "The place is completely unbelievable."
zh_cn: 马克等着他描述圣卢卡斯，但他只是又摇了摇头，然后说：“那个地方简直是棒极了。”

source: "Really," Nance said.
zh_cn: “真的，”南斯说。

source: It turned out that the star of the picture was Nita Damon.
zh_cn: 他们这部电影的主角原来是尼塔·达蒙。

source: This was a real coincidence, because Mark had seen Nita Damon about six months ago in a show in Germany, a Bob Hope Christmas Special.
zh_cn: 这真巧，因为大约六个月前，马克在德国的一场演出上，一场“鲍勃·霍普圣诞特别秀”上，见过尼塔·达蒙。

source: "That's amazing," Nance said.
zh_cn: “那太棒了，”南斯说。

source: She and Barney looked at each other.
zh_cn: 她和巴尼对视了一下。

source: "You should scratch Blythe," Barney said.
zh_cn: “你应该抛掉布莱兹，”巴尼说。

source: Mark grinned.
zh_cn: 马克咧嘴笑了。

source: Nance was staring at him.
zh_cn: 南斯正盯着他看。

source: "Marco," she said. "You're not a Mark, you're a Marco."
zh_cn: “马寇，”她说，“你不是马克，你是马寇。”

source: "You should sign on with us," Barney said. "Ride the stiffmobile express."
zh_cn: “你应该跟着我们干，”巴尼说，“搭乘这趟流浪快车。”

source: "You should," Nance said. "San Lucas is just incredible."
zh_cn: “对呢，”南斯说，“圣卢卡斯简直棒极了。”

source: "Partyville," Barney said.
zh_cn: “派对圣地，”巴尼说。

source: "Jesus," Mark said. "No. I couldn't."
zh_cn: “天啊，”马克说，“不，我不能。”

source: "Sure you could," Barney said. "Lincoln freed the slaves, didn't he?
zh_cn: “你肯定能，”巴尼说，“林肯不是解放了奴隶吗？

source: Get your car later."
zh_cn: 以后再来取你的车。”

source: Mark was laughing.
zh_cn: 马克大笑起来。

source: "Come on," he said. "What would I do up there?"
zh_cn: “拜托，”他说，“我去那里做什么呢？”

source: Barney said, "You mean like work?"
zh_cn: 巴尼说：“你是说像工作那样？”

source: Mark nodded.
zh_cn: 马克点了点头。

source: "No problem," Barney said.
zh_cn: “别担心，”巴尼说。

source: He told Mark that there was always something to do.
zh_cn: 他告诉马克，说总有事情可以做。

source: People didn't show up, people quit, people got sick- there was always a call out for warm bodies.
zh_cn: 有人缺勤，有人辞职，有人生病——对活人的需求是不会断的。

source: Once you found a tasty spot, you just settled in.
zh_cn: 只要找到好位置，你就安定下来。

source: "You mean I'd be working on the movie?
zh_cn: “你是说我会做电影？

source: On the film crew?"
zh_cn: 和剧组工作？”

source: "Absitively," Barney said. "I guarantee."
zh_cn: “一定以及肯定，”巴尼说，“我保证。”

source: "Jesus," Mark said.
zh_cn: “天啊，”马克说。

source: He took a breath. He looked at Barney and Nance.
zh_cn: 他吸了一口气，然后看着巴尼和南斯。

source: "I don't know," he said.
zh_cn: “我不知道，”他说。

source: "That's all right," Barney said. "I know."
zh_cn: “没关系，”巴尼说，“我知道就行。”

source: "Barney knows," Nance said.
zh_cn: “巴尼知道，”南斯说。

source: "What have you got to lose?" Barney said.
zh_cn: “你有什么舍不得的？”巴尼说。

source: Mark didn't say anything. He took another breath.
zh_cn: 马克没说话，又吸了口气。

source: Barney watched him.
zh_cn: 巴尼看着他。

source: "Marco," he said. "Don't tell me- you've got a little something else back there besides the car, right?"
zh_cn: “马寇，”他说，“别告诉我——你除了车以外，还有其它东西在后面，是吗？”

source: When Mark didn't answer, Barney laughed.
zh_cn: 马克没有回答，巴尼大笑起来。

source: "That's mellow," he said. "You're among friends."
zh_cn: “放轻松，”他说，“我们都是自己人。”

source: "I have to think," Mark said.
zh_cn: “我得考虑下，”马克说。

source: "Okay," Barney said. "Think. You've got till Blythe."
zh_cn: “好的，”巴尼说，“考虑下，到布莱兹之前你都可以考虑。”

source: "Don't disappoint me," he said.
zh_cn: “别让我失望，”他说。

source: Nance smiled. Then she turned around too.
zh_cn: 南斯微笑了，然后也把身子转了过去。

source: The top of her head was just visible over the high seat-back.
zh_cn: 在高高的椅背上面，刚好可以看到她的头顶。

source: The desert went past the window, always the same.
zh_cn: 窗外的沙漠向后逝去，一成不变。

source: The road had an oily look.
zh_cn: 公路看上去油腻腻的。

source: Mark felt rushed, a little wild.
zh_cn: 马克觉得仓促，有点盲目。

source: His first idea was to get the directions to San Lucas, then drive up with Krystal and Hans after the car was fixed.
zh_cn: 他最先是想知道去圣卢卡斯的路线，然后把车修好，开车带着克莉斯托和汉克去那里。

source: But that wouldn't work.
zh_cn: 但是这行不通。

source: He wouldn't have enough money left for the gas, let alone food and motels and a place to live once they got there.
zh_cn: 他剩下的钱不够加油，更不用说路上的吃住，以及到那了里过后找地方住。

source: He'd miss his chance.
zh_cn: 他要错过这个机会了。

source: Because that's what this was- a chance.
zh_cn: 因为这既是机会，也是冒险。

source: There was no point in fooling himself.
zh_cn: 自欺欺人并没有意义。

source: He could go to Los Angeles and walk the streets for months, years maybe, without ever getting anywhere.
zh_cn: 他可以去洛杉矶，然后在街上游荡几个月，甚至几年，然后一事无成。

source: He could stand outside closed doors and suck up to nobodies and sit in plastic chairs half his life without ever coming close to where he was right now, on his way to a guaranteed job in Partyville.
zh_cn: 他可以站在紧闭的门前，不去奉承任何人，半辈子都坐在塑料椅子里，然后再也得不到现在这样的机会去派对圣地找份已经有着落的工作。

source: Los Angeles wasn't going to work.
zh_cn: 洛杉矶行不通。

source: Mark could see that.
zh_cn: 马克明白这点。

source: He'd borrow money from his friend and start hustling and he wouldn't get the time of day from anyone, because he was hungry, and nobody ever had time for hungry people.
zh_cn: 他会从朋友那里借钱，然后开始不停忙活；他得不到任何人的关注，因为他饿着肚子，而且没有人会把时间花在饿肚子的人身上。

source: Hungry people got written off.
zh_cn: 人们觉得饿肚子的人没有价值。

source: It was like Dutch said- them as has, gets.
zh_cn: 就像达奇说的那样——人越有钱，就挣得越多。

source: He would run himself ragged and the money would disappear, the way all his other money had disappeared.
zh_cn: 他会让自己工作得精疲力竭，工作的收入会消失，就像其它收入消失那样。

source: Krystal would get worried and sad.
zh_cn: 克莉斯托会担心、伤心。

source: After a couple of weeks Mark and his buddy wouldn't have anything to say to each other, and his buddy would get tired of living with a guy he didn't really know that well and a yelling kid and a sad, pregnant woman.
zh_cn: 过几个星期，马克和他的朋友之间就会没有话说。他朋友便会对一个并不那么了解的人、一个吵吵嚷嚷的小孩和一个悲伤的孕妇感到厌烦。

source: He would tell Mark some lie to get rid of them- his girl was moving in, his parents had decided to stay together after all.
zh_cn: 为了摆脱他们，他会给马克说些谎话——女朋友要搬进来住，父母最终决定不离婚。

source: By then Mark would be broke again.
zh_cn: 到那个时候，马克又会一穷二白。

source: Krystal would have a fit and probably go into labor.
zh_cn: 克莉斯托会大发脾气，或许还会早产。

source: What if that happened? What then?
zh_cn: 这种事情要是发生了会怎么样？

source: Mark knew what. Crawl home to Dutch and Dottie.
zh_cn: 马克知道会怎么样——回家巴结达奇和朵蒂。

source: No. No sir.
zh_cn: 不，这样不行。

source: The only way he was going back to Phoenix was in a coffin.
zh_cn: 要他回到菲尼克斯，除非是在他死了过后。

source: The driver started talking to herself.
zh_cn: 女司机开始自言自语。

source: Barney rapped her on top of the head with his knuckles.
zh_cn: 巴尼用指关节敲了敲她的头顶。

source: "Do you want me to drive?" he said.
zh_cn: “你想我来开车吗？”他说。

source: It sounded like a threat.
zh_cn: 这听起来像是威胁。

source: She quieted down.
zh_cn: 女司机安静了下来。

source: "All right," he said.
zh_cn: “好了，”他说。

source: Without looking back he said, "Five miles to Blythe."
zh_cn: 然后，他又不回头地说：“到布莱兹还有五英里。”

source: Mark looked out the window.
zh_cn: 马克看着窗外。

source: He couldn't get it out of his mind that here he had exactly what he needed. A chance to show what he was made of.
zh_cn: 他没法不去思考自己想要的东西——展示自己才能的机会——就在手里。

source: He'd have fun, sure, but he'd also be at work on time in the morning.
zh_cn: 他肯定会过得开心，但是他也要每天早上按时上班。

source: He would do what he was told and do it right.
zh_cn: 他要按别人的指示办事，而且要把事情办好。

source: He would keep his eyes open and his mouth shut and after a while people would start to notice him.
zh_cn: 他要睁大眼睛，闭紧嘴巴，然后过段时间人们就会注意到他。

source: He wouldn't push too hard, but now and then he might do a song at one of the parties, or impersonate some of the actors.
zh_cn: 他不会太强求，但是可以偶尔在聚会上唱首歌，或者模仿某位演员。

source: He could just hear Nita Damon laughing and saying, "Stop it, Mark! Stop it!"
zh_cn: 他会听到尼塔·达蒙大笑着说：“够了，马克！够了！”

source: What he could do, Mark thought, was to call Krystal and arrange to meet up with her at his buddy's house in a month or two, after they'd shot the film.
zh_cn: 马克心想，可以打电话给克莉斯托，让她等着他们拍完电影，然后在一两个月内去他朋友家与他相聚。

source: Mark would have something going then. He'd be on his way.
zh_cn: 他那时将会小有成就，走上正轨。

source: But that wouldn't work, either.
zh_cn: 但是这也行不通。

source: He didn't know how to call her.
zh_cn: 他不知道怎么给她打电话。

source: She had no money. And she wouldn't agree.
zh_cn: 她没有钱，而且也不会同意。

source: Mark wasn't going to fool himself.
zh_cn: 马克不打算自欺欺人。

source: If he left Krystal and Hans back there, she would never forgive him.
zh_cn: 如果他把克莉斯托和汉斯丢在后面，那么克莉斯托就永远不会原谅他。

source: If he left them, he left them for good.
zh_cn: 如果他抛下他们，那么他就是永远的抛下了他们。

source: I can't do that, Mark thought.
zh_cn: 我不能那样做，马克心想。

source: But he knew this wasn't true.
zh_cn: 但是他知道这种想法不是真的。

source: He could leave them.
zh_cn: 他能够抛弃他们。

source: People left one another, and got left, every day.
zh_cn: 每天都有人抛弃别人，被别人抛弃。

source: It was a terrible thing. But it happened and people survived, as they survived worse things.
zh_cn: 这是件糟糕的事情，但它就是发生了，而人们也像挺过更糟糕的事情那样挺了过去。

source: Krystal and Hans would survive, too.
zh_cn: 克莉斯托和汉斯也会挺过去的。

source: When she understood what had happened she would call Dutch.
zh_cn: 在她知道发生了什么事情时，她会打电话给达奇。

source: Dutch would hit the roof, but in the end he would come through for them.
zh_cn: 达奇会暴跳如雷，但最终还是会过去接他们。

source: He didn't have any choice.
zh_cn: 他别无选择。

source: And in four or five years what happened today would be nothing but a bad memory.
zh_cn: 而且，过个四五年，今天发生的事情就会什么都不是，只是难堪的回忆。

source: Krystal would do well for herself.
zh_cn: 克莉斯托能够过得好。

source: Men liked her.
zh_cn: 男人们都喜欢她。

source: Even Dutch liked her, though he'd been dead set against the marriage.
zh_cn: 甚至达奇也喜欢她，尽管他坚决反对马克与她的婚姻。

source: She would meet a good man someday, a man who could take care of her.
zh_cn: 她未来会遇到好男人，一个能够照顾她的男人。

source: She and Hans and the new baby would be able to go to sleep at night without wondering what would happen to them when they woke up.
zh_cn: 她、汉斯，以及那个新生的孩子，都能够在晚上睡去，不用在醒来时思考发生了什么事情。
